Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/notaries_public.html.txt.tmx
Source language: en
Languages: ga

source: A notary public is a public officer who serves the public in non-contentious matters usually concerned with foreign or international business
ga: Oifigeach poiblí is ea nótaire poiblí a dhéanann freastal ar an bpobal in ábhair neamhchonspóideacha a bhaineann de ghnáth le gnó iasachta nó idirnáisiúnta

source: Notaries are appointed by the Chief Justice
ga: Bíonn nótairí ceaptha ag an bPríomh-Bhreitheamh

source: In general only solicitors are appointed
ga: Go ginearálta, ní cheaptar ach aturnaetha

source: What do notaries public do?
ga: Céard a dhéanann nótairí poiblí?

source: Notaries certify the execution in their presence of a deed, a contract or other writing
ga: Deimhníonn nótairí forghníomhú gnímh, conartha nó scríofa eile ina láithreacht

source: They can also verify some act or thing done in their presence
ga: Ina theannta sin, deimhníonn siad gníomh nó rud éigin a dhéantar agus iad i láthair

source: Among the things they do are:
ga: I measc na rudaí a dhéanann siad tá an méid a leanas:

source: • Witnessing and proving signatures to documents
ga: • Bheith ina bhfinnéithe le sínithe le cáipéisí agus iad a chruthú

source: • Taking affidavits (other than for the courts in Ireland)
ga: • Mionnscríbhinní a ghlacadh (seachas do na cúirteanna in Éirinn)

source: • Drawing up Powers of Attorney and other legal documents customarily prepared by notaries public
ga: • Cumhachtaí Aturnae agus cáipéisí eile dlí a chur i dtoll a chéile a bhíonn sé de nós ag nótairí poiblí a ullmhú

source: When am I likely to need the services of a notary public?
ga: Cathain is dóigh go mbeidh seirbhísí nótaire phoiblí ag teastáil uaim?

source: You are most likely to require a notary where you have to send papers or documents to a foreign jurisdiction
ga: Is é is dóichí go dteastóidh nótaire uait nuair is gá duit páipéir nó cáipéisí a sheoladh chuig dlínse iasachta

source: You may require the services of a notary in relation to:
ga: D’fhéadfadh seirbhísí nótaire bheith ag teastáil uait maidir leis an méid a leanas:

source: • Affidavits for use in foreign courts
ga: • Mionnscríbhinní lena n-úsáid i gcúirteanna iasachta

source: • Copies of State documents for use abroad
ga: • Cóipeanna de cháipéisí Stáit lena n-úsáid thar lear

source: How do I find a notary public?
ga: Conas a aimsím nótaire poiblí?

source: A notary may notarise documents in the county where their principal office is situated and also in some adjoining counties
ga: Féadfaidh nótaire nótaireacht a dhéanamh ar cháipéisí sa tír ina bhfuil a bpríomhoifig lonnaithe agus freisin i roinnt tíortha timpeall ar an tír sin

source: If the notary you choose will be required to notarise documents outside their county, you should check they are authorised to sign and notarise documents in that place
ga: Má bheidh ar an nótaire a roghnaíonn tú nótaireacht a dhéanamh ar cháipéisí lasmuigh dá dtír, ba cheart duit a sheiceáil an bhfuil siad údaraithe chun na cáipéisí a shíniú agus nótaireacht a dhéanamh orthu san áit sin

source: You can find a list of notaries public on the website of the Faculty of Notaries Public in Ireland (see below)
ga: Féadfaidh tú teacht ar liosta nótairí poiblí ar láithreán gréasáin Dhámh na Nótairí Poiblí in Éirinn (féach thíos)

source: When meeting a notary you will be required to prove your identity and residence
ga: Nuair a chasann tú le nótaire, beidh ort d'aitheantas agus do chónaitheacht a chruthú

source: You will be required to bring several forms of identification such as your passport and a recent utility bill
ga: Beidh ort roinnt foirmeacha aitheantais ar nós do phas agus bille fóntais a fuair tú le déanaí a thabhairt leat

source: Who regulates notaries public?
ga: Cé a dhéanann nótairí poiblí a rialú?

source: The Faculty of Notaries Public in Ireland promotes and regulates the profession of notary public in Ireland
ga: Déanann Dámh na Nótairí Poiblí in Éirinn gairm na nótairí poiblí a chur chun cinn agus a rialú in Éirinn

source: There is a code of conduct (pdf) that notaries are required to follow
ga: Is ann do chód iompair (pdf) ar gá do nótairí cloí leis

source: Further information on notaries public is available on the Faculty’s website
ga: Tá fáil ar thuilleadh faisnéise ar nótairí poiblí ar láithreán gréasáin na Dáimhe
